testing/mutation/mutants/m003_merge_cursor_no_advance.patch
mutant: m003_merge_cursor_no_advance
target: internal/ingest/orchestrator/merge_runner.go
failure-mode: |
  The merge source cursor commits sf.Idx instead of sf.Idx+1, so a merge
  restart re-processes the just-completed source segment and re-appends its
  events to the destination. Models an off-by-one when deciding whether a
  cursor records "last done" vs "next to do".
expected-detection: |
  In a multi-source restart scenario, a crash after source N has committed
  and source N+1 has flushed leaves the cursor at N+1. The mutant persists N,
  so restart reprocesses an already-committed source. The dedicated
  restart-multisource tier captures that source's rows before recovery and
  asserts surviving rows appear exactly once after recovery.
expected-tier: restart-multisource
tiers: restart-multisource

diff --git a/internal/ingest/orchestrator/merge_runner.go b/internal/ingest/orchestrator/merge_runner.go
--- a/internal/ingest/orchestrator/merge_runner.go
+++ b/internal/ingest/orchestrator/merge_runner.go
@@ -92,7 +92,7 @@
 			if err := r.simulateCrash(ctx, crashpoint.AfterMergeDstFlushBeforeSourceCommit); err != nil {
 				return err
 			}
-			if err := commitSourceComplete(r.store, r.cache, sf.Index+1, perDID, r.now()); err != nil {
+			if err := commitSourceComplete(r.store, r.cache, sf.Index, perDID, r.now()); err != nil {
 				return err
 			}
 			r.metrics.incMergeSegmentsConsumed()
