testing/mutation/mutants/m006_merge_commit_error_swallowed.patch
mutant: m006_merge_commit_error_swallowed
target: internal/ingest/orchestrator/merge_runner.go
failure-mode: |
  The error check on the source-cursor commit is inverted (== nil), so a
  failed commit is silently ignored and merge proceeds. Models the classic
  inverted err check that swallows a persistence failure.
expected-detection: |
  Requires forcing the source-cursor batch commit to fail: the store-fault
  tier (#30) injects a deterministic fault on the merge/next_source_idx commit
  and asserts the runtime fails LOUD (sentinel surfaced up through
  Orchestrator.Run) rather than swallowing the error and advancing past
  unarchived data. The inverted check also early-returns on a CLEAN commit, so
  the orchestrator multi-source test (every source's survivors must reach dst)
  catches it too. Both run in the storefault tier.
expected-tier: storefault
tiers: storefault

diff --git a/internal/ingest/orchestrator/merge_runner.go b/internal/ingest/orchestrator/merge_runner.go
--- a/internal/ingest/orchestrator/merge_runner.go
+++ b/internal/ingest/orchestrator/merge_runner.go
@@ -92,7 +92,7 @@
 			if err := r.simulateCrash(ctx, crashpoint.AfterMergeDstFlushBeforeSourceCommit); err != nil {
 				return err
 			}
-			if err := commitSourceComplete(r.store, r.cache, sf.Index+1, perDID, r.now()); err != nil {
+			if err := commitSourceComplete(r.store, r.cache, sf.Index+1, perDID, r.now()); err == nil {
 				return err
 			}
 			r.metrics.incMergeSegmentsConsumed()
