testing/mutation/mutants/m059_unregistered_replay_hole_skipped.patch
mutant: m059_unregistered_replay_hole_skipped
target: internal/subscribe/replay.go
failure-mode: |
  Cold replay treats a catalog view that ends below the readable-log floor
  as successful completion even when no durable registry entry authorizes the
  missing tail. The floor promised durable data and the view was taken after
  the floor was read, so a missing/corrupt tail segment becomes silent client
  data loss, regressing the issue #190 crash-loud seam guard.
expected-detection: |
  The seqlease tier's unregistered-gap tests withhold the tail segment below
  the floor and require replay to fail loud at the end of the catalog.
  Registered-gap tests (including a registered gap that must not mask a
  missing tail segment) ensure the fix is selective rather than rejecting
  valid vacancies.
expected-tier: seqlease
tiers: seqlease

diff --git a/internal/subscribe/replay.go b/internal/subscribe/replay.go
--- a/internal/subscribe/replay.go
+++ b/internal/subscribe/replay.go
@@ -194,7 +194,7 @@
 	// the floor was read.
 	w.jumpGap()
 	if stopSeq != 0 && w.current < stopSeq {
-		return fmt.Errorf("subscribe: cold replay reached the end of the catalog at seq %d before readable-log floor %d (unregistered sequence hole)", w.current, stopSeq)
+		return nil
 	}
 	return nil
 }
