testing/mutation/mutants/m010_nextblockoffset_reset.patch
mutant: m010_nextblockoffset_reset
target: segment/writer.go
failure-mode: |
  nextBlockOffset is assigned (=) the current frame length instead of being
  accumulated (+=), so after the first flush every block's recorded offset is
  wrong. Models a += vs = typo in offset bookkeeping.
expected-detection: |
  Multi-block segments get colliding/wrong block offsets; decoding or
  rewrite should fail or mis-read, surfacing via ObserveSegments or Compare.
  Needs >1 block, so scale helps — but default may catch it.
expected-tier: default
tiers: default,stress

diff --git a/segment/writer.go b/segment/writer.go
index 3a7842a..02a5a5c 100644
--- a/segment/writer.go
+++ b/segment/writer.go
@@ -518,7 +518,7 @@ func (w *Writer) flushLocked() error {
 		MaxIndexedAt:     w.pending.pendingBounds.maxIndexedAt,
 	}
 	w.flushedBlocks = append(w.flushedBlocks, info)
-	w.nextBlockOffset += uint64(len(w.wireScratch))
+	w.nextBlockOffset = uint64(len(w.wireScratch))
 
 	// Drop the pending buffer so a Sync failure cannot re-encode the
 	// same rows on a retry.
