testing/mutation/mutants/m011_wire_frame_length.patch
mutant: m011_wire_frame_length
target: segment/writer.go
failure-mode: |
  The active-segment frame length prefix is written as the full scratch
  length instead of length-8 (excluding the prefix itself). On reopen the
  torn-tail scan reads a frame 8 bytes too long, declares the tail torn, and
  truncates the block. Models forgetting to subtract the prefix width.
expected-detection: |
  Events in the final unsealed block are silently dropped on reopen; Compare
  should report missing records after a restart/reopen. Restart tier
  strengthens it.
expected-tier: stress
tiers: default,stress,restart

diff --git a/segment/writer.go b/segment/writer.go
index 1bba456..084a262 100644
--- a/segment/writer.go
+++ b/segment/writer.go
@@ -548,7 +548,7 @@ func (w *Writer) flushLocked() error {
 	// the second-buffer-plus-memcpy the previous design needed.
 	w.wireScratch = append(w.wireScratch[:0], 0, 0, 0, 0, 0, 0, 0, 0)
 	w.wireScratch = blockEncoder.EncodeAll(w.bodyScratch, w.wireScratch)
-	binary.LittleEndian.PutUint64(w.wireScratch[:8], uint64(len(w.wireScratch)-8))
+	binary.LittleEndian.PutUint64(w.wireScratch[:8], uint64(len(w.wireScratch)))
 
 	if err := w.cfg.beforeIO(IOOpWrite); err != nil {
 		w.stickyErr = fmt.Errorf("segment: write block: %w", err)
