testing/mutation/mutants/m015_collection_count_double.patch
mutant: m015_collection_count_double
target: segment/seal.go
failure-mode: |
  The per-collection event count in the footer is incremented by 2 instead
  of 1, corrupting the collection index. Models a stray increment. (The
  increment moved into the shared internCollection helper in #175; the count
  is now guarded by countEvent so sentinel ids do not inflate it.)
expected-detection: |
  PREDICTED SURVIVAL: the oracle decodes every block sequentially and never
  consults the footer collection index, so a corrupt count is invisible to
  it. This mutant documents a known read-path/footer-index blind spot.
expected-tier: none
tiers: default,stress

diff --git a/segment/seal.go b/segment/seal.go
--- a/segment/seal.go
+++ b/segment/seal.go
@@ -244 +244 @@ func (res *blockWalkResult) internCollection(collection string, countEvent bool,
-		res.collectionEventCounts[id]++
+		res.collectionEventCounts[id] += 2
