testing/mutation/mutants/m024_compaction_over_drop_survivors.patch
mutant: m024_compaction_over_drop_survivors
target: internal/ingest/orchestrator/compact_deletes.go
failure-mode: |
  The compaction rewrite keep-guard returns RowDrop instead of RowKeep for
  rows that ShouldDrop did NOT mark, so every surviving materialization row at
  or below the chunk watermark is physically deleted: a blanket compaction
  over-drop / data-loss bug.
expected-detection: |
  Killed at the after-merge assertOracleMatches -> Compare (final-state)
  in TestOracle_DefaultLifecycle: dropping ALL survivors also removes rows
  that are still live in the simulator world, so final-state comparison
  diverges ("missing <did> <coll>/<rkey>"). Default tier.

  NOTE on the #100 over-drop check: this blanket mutant is caught by
  final-state Compare BEFORE the metamorphic compactionOverDropRecorder.Assert
  runs, so it does not by itself exercise that check's UNIQUE power (catching
  an over-drop that final-state convergence hides). That unique case requires
  a survivor dropped at/below W but independently superseded ABOVE W.

  CORRECTION (2026-06-20): an earlier version of this note claimed the
  convergence-hiding case was "structurally unreachable in steady mode"
  because force-rotation makes W cover every event. That is WRONG and was
  refuted empirically: a delete arriving in the new active segment AFTER the
  force-rotate has seq > targetWatermark and remains in the live tombstone set
  above W, so the straddle (create <= W, delete > W) is the normal steady-state
  shape. The end-to-end convergence-hiding over-drop was exercised by
  m025_compaction_overdrop_above_watermark until its Set.SnapshotRange
  mechanism was deleted in #178; the #183 analysis (2026-07-04 RESULTS.md
  section) concluded no single-edit replacement exists under the windowed-fold
  architecture, so the recorder is a regression assertion without a gated
  mutant. This blanket mutant remains the compaction data-loss coverage.
expected-tier: default
tiers: default

diff --git a/internal/ingest/orchestrator/compact_deletes.go b/internal/ingest/orchestrator/compact_deletes.go
--- a/internal/ingest/orchestrator/compact_deletes.go
+++ b/internal/ingest/orchestrator/compact_deletes.go
@@ -353,7 +353,7 @@
 						droppedByReason[reason]++
 						return segment.RowDrop
 					}
-					return segment.RowKeep
+					return segment.RowDrop
 				}, segment.RewriteOptions{
 					CrashInjector:   crashpoint.ForSegment(o.cfg.CrashInjector),
 					IOFaultInjector: o.cfg.SegmentIOFaultInjector,
