testing/mutation/mutants/m028_compaction_watermark_save_error_swallowed.patch
mutant: m028_compaction_watermark_save_error_swallowed
target: internal/ingest/orchestrator/compact_deletes.go
failure-mode: |
  The error check on the compaction watermark save is inverted (== nil), so a
  failed persistent watermark write is silently swallowed and the pass
  proceeds: the in-memory gauge and finalWatermark advance and tombstones are
  evicted while the durable compaction/seq stays stale. A swallowed-
  persistence-error in the same family as m006, on the compaction-watermark
  fault point named in issue #30.
expected-detection: |
  Killed by the store-fault tier: TestCompaction_StoreFaultOnWatermarkSave_*
  forces the watermark Set to fail and asserts the pass fails LOUD and the
  durable watermark does not advance. Without a forced store fault the Set
  always succeeds, so the inverted check is dormant (would otherwise survive).
expected-tier: storefault
tiers: storefault

diff --git a/internal/ingest/orchestrator/compact_deletes.go b/internal/ingest/orchestrator/compact_deletes.go
index 9ef6801..26330f1 100644
--- a/internal/ingest/orchestrator/compact_deletes.go
+++ b/internal/ingest/orchestrator/compact_deletes.go
@@ -179,7 +179,7 @@ func (o *Orchestrator) runDeleteCompaction(ctx context.Context, mode compactionM
 				return err
 			}
 
-			if err := saveCompactionWatermark(o.cfg.Store, chunkEnd); err != nil {
+			if err := saveCompactionWatermark(o.cfg.Store, chunkEnd); err == nil {
 				return err
 			}
 			o.cfg.Metrics.setCompactionWatermark(chunkEnd)
