testing/mutation/mutants/m033_client_too_old_400_not_rebackfilled.patch
mutant: m033_client_too_old_400_not_rebackfilled
target: client_core.go
failure-mode: |
  The cutover tail never reports the §14 too-old 400 to the pagination loop
  (the terminal error is replaced with nil), so runBackfillThenLive treats a below-floor connect
  as a clean stop and ENDS instead of re-entering the backfill loop. A client
  whose handoff cursor aged below the lookback floor silently stops at the seam
  rather than re-backfilling and converging — the fell-off-live / slow-handoff
  recovery path is dead.
expected-detection: |
  Killed by TestPartB_CaughtUpHandoffBelowFloorReBackfills (#182, partb tier):
  the below-floor handoff no longer triggers a re-backfill cycle
  (RebackfillCycles stays 0) and the fresh in-window segment is never
  downloaded, so the folded stream never converges to ground truth and the
  drain times out / diverges.
expected-tier: partb
tiers: partb

diff --git a/client_core.go b/client_core.go
--- a/client_core.go
+++ b/client_core.go
@@ -741,8 +741,8 @@ func (e *replayEngine) tailLiveFromCutover(ctx context.Context, b *batcher, cuto
 			return true
 		}
 		return b.add(*ev)
 	})
-	return consumer.LastSeq(), err
+	return consumer.LastSeq(), nil
 }
 
 // fetchZstdDict fetches the server's current live-tail compression
