testing/mutation/mutants/m044_flush_write_fault_check_dropped.patch
mutant: m044_flush_write_fault_check_dropped
target: segment/writer.go
failure-mode: |
  flushLocked drops the pre-write I/O fault consult (the beforeIO error is
  discarded), so an injected write failure on the active segment's block
  flush is silently ignored and the flush proceeds as if durable. Models a
  swallowed segment write error on the hottest persistence path: the caller's
  cursor/seq commit then advances past a block that (on real hardware) never
  hit the disk — silent data loss at the exact boundary the #201/#200 seam
  exists to keep loud.
expected-detection: |
  Killed by the segmentfault tier at two independent layers:
  1. Segment unit layer: TestFlushReturnsENOSPCOnBlockWrite arms IOOpWrite on
     the block-flush consult and requires ENOSPC out of Flush; the mutant
     returns nil (the consult still runs — ordinals are unchanged — but its
     error is dropped).
  2. Oracle layer: with #262 fixed the write-shortwrite-first-flush case
     (ordinal 3, reaches flushLocked) is un-skipped, so the swallowed flush
     error means the runtime no longer fails loud — the observed-marker is
     withheld and TestOracle_RestartSegmentFault_FailsLoudThenRecovers trips.
     (The ENOSPC@1 case fires in initializeNewSegment, whose consult this
     mutant leaves intact, so that case alone would not catch it.)
expected-tier: segmentfault
tiers: segmentfault

diff --git a/segment/writer.go b/segment/writer.go
index 123c818..5e145e6 100644
--- a/segment/writer.go
+++ b/segment/writer.go
@@ -395,10 +395,7 @@ func (w *Writer) flushLocked() error {
 	w.wireScratch, info = w.pending.appendFrame(w.wireScratch)
 	binary.LittleEndian.PutUint64(w.wireScratch[:8], uint64(len(w.wireScratch)-8))
 
-	if err := w.cfg.beforeIO(IOOpWrite); err != nil {
-		w.stickyErr = fmt.Errorf("segment: write block: %w", err)
-		return w.stickyErr
-	}
+	_ = w.cfg.beforeIO(IOOpWrite)
 	if _, err := w.file.WriteAt(w.wireScratch, int64(w.nextBlockOffset)); err != nil {
 		w.stickyErr = fmt.Errorf("segment: write block: %w", err)
 		return w.stickyErr
