testing/mutation/mutants/m051_merge_cleanup_dir_fsync_deleted.patch
mutant: m051_merge_cleanup_dir_fsync_deleted
target: internal/catalog/local/storage.go
failure-mode: |
  Merge cleanup removes the data/backfill subtree through the local catalog's
  DeleteNamespace and then deletes the merge cursors, but DeleteNamespace's
  parent-directory (data-dir) fsync after the RemoveAll is gone, so nothing
  orders the unlink before the SyncWrites cursor deletes. deleteMergeCursor
  commits with store.SyncWrites, so the cursor deletion is durable immediately
  while the dirent removal is not. A power loss in that window rolls back the
  removal while keeping the cursor deletion: on restart the phase is still
  PhaseMerging, backfill/live_segments reappears, the catalog lists its
  segments again so the restart-after-cleanup guard (an empty bootstrap_live
  namespace) is skipped, and the drain re-runs from cursor 0, appending
  already-merged survivors a second time into data/segments and corrupting the
  archive with duplicate events.
expected-detection: |
  Killed by the powerloss tier's
  TestRunMerge_StrictMemPowerLossCleanupComplete. The test drains a survivor
  (rev above the backfill watermark) into data/segments, fires the
  AfterMergeCleanupComplete crashpoint to simulate a power cut on strict-mem,
  resets to the durable synced state, re-runs runMerge, and requires the
  survivor to appear exactly once. Under this mutant the rolled-back backfill
  tree drives a re-drain and the survivor lands twice (count 2, want 1). The
  default oracle lifecycle does not catch it: without a real power cut the
  data-dir fsync is invisible to normal operation.
expected-tier: powerloss
tiers: powerloss

diff --git a/internal/catalog/local/storage.go b/internal/catalog/local/storage.go
--- a/internal/catalog/local/storage.go
+++ b/internal/catalog/local/storage.go
@@ -89,9 +89,6 @@
 	if err := c.fs.RemoveAll(root); err != nil {
 		return fmt.Errorf("catalog/local: remove %s: %w", root, err)
 	}
-	if err := c.syncDir(c.fs.PathDir(root)); err != nil {
-		return err
-	}
 	c.DropNamespace(ns)
 	return nil
 }
