testing/mutation/mutants/m061_same_segment_gap_silently_crossed.patch
mutant: m061_same_segment_gap_silently_crossed
target: internal/subscribe/replay.go
failure-mode: |
  Bounded cold replay silently crosses an unregistered sequence hole between
  two durable block refs, whether they share one segment envelope or sit in
  adjacent segments. A missing crash-gap record or a withheld segment in the
  middle of the archive can then become silent client data loss.
expected-detection: |
  The seqlease tier's same-segment unregistered-gap test writes two durable
  blocks with a hole between their preserved block envelopes and requires
  replay to fail loud. The compacted-block companion proves sparse rows inside
  a historical block envelope remain valid without a crash-gap record.
expected-tier: seqlease
tiers: seqlease

diff --git a/internal/subscribe/replay.go b/internal/subscribe/replay.go
--- a/internal/subscribe/replay.go
+++ b/internal/subscribe/replay.go
@@ -156,7 +156,7 @@
 		}
 		if ref.MinSeq > w.current {
 			if stopSeq != 0 && w.current < stopSeq {
-				return fmt.Errorf("subscribe: unregistered sequence hole [%d,%d) before segment %d block %d", w.current, ref.MinSeq, ref.Segment, ref.Block)
+				w.current = ref.MinSeq
 			}
 			// Unbounded callers retain the historical compaction/replay behavior:
 			// emit every extant row without asserting complete coverage to a floor.
