testing/mutation/mutants/m064_relay_cursor_per_block.patch
mutant: m064_relay_cursor_per_block
target: internal/ingest/hot.go
failure-mode: |
  The hot writer runs the durable batch hook (relay cursor plus verifier
  sync state) only for the batch that closes a block, as the local writer's
  per-block durability did, instead of in every hot batch transaction
  (design §10.4). Batches in the middle of a block commit rows without the
  cursor that covers them. After a leader change the successor resumes
  from an older cursor with older chain state and archives whole events a
  second time.
expected-detection: |
  The layer 3 oracle's duplicates rule (disaggCover) allows only a re-
  archived commit prefix per leader change; whole events archived twice
  fail it. Every full seed has leader crashes between hot batches.
expected-tier: disagg
tiers: disagg

diff --git a/internal/ingest/hot.go b/internal/ingest/hot.go
--- a/internal/ingest/hot.go
+++ b/internal/ingest/hot.go
@@ -817,7 +817,7 @@ func (h *hotWriter) commitBatch(b *hotBatch) error {
 		ops := metastore.NewOpBatch(nil)
 		var afterCommit func()
 		var afterDone func(error)
-		if hook := h.hook(); hook != nil {
+		if hook := h.hook(); hook != nil && b.start+b.n >= h.cfg.MaxEventsPerBlock {
 			var err error
 			afterCommit, afterDone, err = hook(ctx, ops, next, false, b.prepareValue)
 			if err != nil {
